#### Leader Members

---

|  |
| --- |
| Leader Class   Methods   Properties   See Also |

The  Leader  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Anchor | Anchor point of the Leader |
| Public property | Elbow | Elbow point of the Leader. |
| Public property | End | End point of the Leader. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LeaderShape | Geometric style of the leader |

# See Also

Leader Class

Autodesk.Revit.DB Namespace